routes/web.php

    if (Auth::user()->level_id !== $user->level_id) {
        return redirect()->back();
    }
    return view('account.edit', [
        'user' => $user->with('level')->where('id', $user->id)->get()
    ]);
---
SELECT * FROM `levels` WHERE `levels`.`id` in (3)
SELECT * FROM `users` WHERE `id` = 3