app/Http/Controllers/ActivityLogController.php

SELECT * FROM `activity_logs` WHERE date(`created_at`) = '2023-12-02' ORDER BY `created_at` DESC
SELECT * FROM `levels` WHERE `levels`.`id` in (3)
SELECT * FROM `users` WHERE `users`.`id` in (3)
---
    public function index ()
    {
        $data = ActivityLog::with(['user', 'user.level'])->whereDate('created_at', Carbon::now())->latest()->get();