app/Http/Controllers/DashboardController.php

    public function index()
    {
        return view('home', [
            "total_menus" => Menu::all()->count(),
            'total_sales' => Transaction::select(Transaction::raw('SUM(total_transaction) as total_sales'))->whereDate('created_at', NOW()->toDateString())->get(),
            'total_income' => Transaction::select(Transaction::raw('SUM(total_payment) as total_income'))->whereDate('created_at', NOW()->toDateString())->get(),
            'invoice' => Transaction::select(Transaction::raw('COUNT(id) as total_invoice'))->whereDate('created_at', NOW()->toDateString())->get(),
            'cashier' => User::select(User::raw('COUNT(id) as cashier'))->where('level_id', 2)->get(),
            'admin' => User::select(User::raw('COUNT(id) as admin'))->where('level_id', 3)->get(),
            'manager' => User::select(User::raw('COUNT(id) as manager'))->where('level_id', 2)->get(),
            'total_user' => User::select(User::raw('COUNT(id) as total_user'))->get(),
            'total_paid' => Transaction::select(Transaction::raw('COUNT(id) as total_paid'))->where('status','paid')->get(),
            'total_unpaid' => Transaction::select(Transaction::raw('COUNT(id) as total_unpaid'))->where('status','unpaid')->get(),
            'tables' => Transaction::select(Transaction::raw('COUNT(no_table) as tables'))->where('status','unpaid')->get()
---
SELECT SUM(total_transaction) as total_sales FROM `transactions` WHERE date(`created_at`) = '2023-12-02'
SELECT SUM(total_payment) as total_income FROM `transactions` WHERE date(`created_at`) = '2023-12-02'
SELECT COUNT(id) as total_invoice FROM `transactions` WHERE date(`created_at`) = '2023-12-02'
SELECT COUNT(id) as cashier FROM `users` WHERE `level_id` = 2
SELECT COUNT(id) as admin FROM `users` WHERE `level_id` = 3
SELECT COUNT(id) as manager FROM `users` WHERE `level_id` = 2
SELECT COUNT(id) as total_user FROM `users`
SELECT COUNT(id) as total_paid FROM `transactions` WHERE `status` = 'paid'
SELECT COUNT(id) as total_unpaid FROM `transactions` WHERE `status` = 'unpaid'
SELECT COUNT(no_table) as tables FROM `transactions` WHERE `status` = 'unpaid'