app/Http/Controllers/LoginController.php

INSERT INTO `activity_logs` (`user_id`, `action`, `updated_at`, `created_at`) VALUES (1, 'logged in', '2023-12-02 15:42:54', '2023-12-02 15:42:54')
---
    public function authenticate(Request $request)
    {
        $credentials = $request->validate([
            'username' => 'required',
            'password' => 'required'
        ]);

        if (Auth::attempt($credentials)) {
            $id = Auth::id();
            $activity = [
                'user_id' => $id,
                'action' => 'logged in'
            ];
            ActivityLog::create($activity);

INSERT INTO `activity_logs` (`user_id`, `action`, `updated_at`, `created_at`) VALUES (1, 'logged out', '2023-12-02 15:49:00', '2023-12-02 15:49:00')
---
    public function logout(Request $request)
    {
        $id = Auth::id();
        $activity = [
            'user_id' => $id,
            'action' => 'logged out'
        ];
        ActivityLog::create($activity);