app/Http/Controllers/TransactionController.php

SELECT count(*) as aggregate FROM `transactions` WHERE `status` = 'paid'
SELECT count(*) as aggregate FROM `transactions` WHERE `status` = 'paid' and date(`created_at`) = '2023-12-02'
SELECT count(*) as aggregate FROM `transactions` WHERE `status` = 'paid' and month(`created_at`) = '12'
SELECT count(*) as aggregate FROM `transactions`
SELECT count(*) as aggregate FROM `transactions` WHERE date(`created_at`) = '2023-12-02'
SELECT count(*) as aggregate FROM `transactions` WHERE month(`created_at`) = '12'
---
    public function index()
    {
        $user = Auth::user();

        if ($user->level_id === 3) {
            return redirect()->back();
        }

        if ($user->level_id == 1) {
            $all = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->where('status', 'paid')
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);
            $today = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->where('status', 'paid')
                                ->whereDate('created_at',Carbon::now())
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);
            $thisMonth = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->where('status', 'paid')
                                ->whereMonth('created_at',Carbon::now()->month)
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);
        } else {
            $all = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);
            $today = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->whereDate('created_at',Carbon::now())
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);
            $thisMonth = Transaction::with(['transaction_details', 'transaction_details.menu'])
                                ->whereMonth('created_at',Carbon::now()->month)
                                ->latest()
                                ->filter(request(['year', 'month']))
                                ->paginate(5);

SELECT `no_table` FROM `transactions` WHERE `status` = 'unpaid'
---
    public function create(Menu $menu)
    {
        $user = Auth::user();

        if ($user->level_id === 1 || $user->level_id === 3) {
            return redirect()->back();
        }

        return view('transaction.create', [
            'foods' => $menu->where('category','food')->latest()->get(),
            'drinks' => $menu->where('category', 'drink')->latest()->get(),
            'desserts' => $menu->where('category', 'dessert')->latest()->get(),
            'tables' => Transaction::select('no_table')->where('status','unpaid')->get()