app/Http/Controllers/UserController.php

    public function index()
    {
        $user = Auth::user();

        if ($user->level_id === 1 || $user->level_id === 2) {
            return redirect()->back();
        }

        return view('user.index', [
            'users' => User::with('level')->get(),
        ]);
---
SELECT * FROM `levels` WHERE `levels`.`id` in (1, 2, 3)
SELECT * FROM `users`

    public function updateProfile(Request $request, User $user)
    {
        Validator::extend('without_spaces', function ($attr, $value) {
            return preg_match('/^\S*$/u', $value);
        });

        $validateddata = $request->validate([
            'name' => 'required|min:3',
            'username' => 'required|min:3|unique:users,username,' . $user->id . '|without_spaces|',
            'email' => 'required|regex:/(.+)@(.+)\.(.+)/i',
            'picture' => 'image|file|max:2048'
        ], [
            'without_spaces' => 'The username cannot contain space'
        ]);

        if ($request->file('picture')) {
            if (strpos($user->picture, 'avatars') === false) {
                $old_pict = 'profile/' . $user->picture;
                Storage::delete($old_pict);
            }
            $file = $request->file('picture');
            $fileName = explode('/', $file->store('profile'))[1];
            $validateddata['picture'] = $fileName;
        }

        User::where('id', $user->id)
            ->update($validateddata);
---
UPDATE `users` SET `name` = 'Azizah', `username` = 'admin', `email` = 'nurazizahwd@gmail.com', `users`.`updated_at` = '2023-12-02 15:36:17' WHERE `id` = 3